onEvent('jei.information', event => {
	///////////////// Яйцо дракона /////////////////
	event.add('minecraft:dragon_egg', [
		'Делается из бездействующего яйца.'
	])
	///////////////// Следящая книга /////////////////
	event.add('pettracker:tracker', [
		'Книга позволяет отслеживать всех добавленных в неё мобов.',
		'Добавить можно только верных вам мобов.',
		'Чтобы добавить моба, нажмите ПКМ на мобе с этой книгой в руке.',
		'\n',
		'Нажатие ПКМ в воздухе откроет интерфейс отслеживания.'
	])
	///////////////// Шкура хоглина /////////////////
	event.add('nethersdelight:hoglin_hide', [
		'Выпадает из хоглина, если убить его ножом или кинжалом.'
	])
	///////////////// Волшебные обломки /////////////////
	event.add('irons_spellbooks:arcane_debris', [
		'Волшебные обломки появляются только в обычном мире на высоте между -60 и -32. Потребуется незеритовая кирка или механическая дрель.',
		'*Вероятность появления: 1 жила на 6 чанков, максимум 3 блока в жиле.',
		'*Наибольшая частота появления в центре диапазона.',
		' ',
		'*Жила не появится на поверхности пещеры (то есть не будет контактировать с воздухом при генерации).'
	])
	///////////////// Замороженная кость /////////////////
	event.add('irons_spellbooks:frozen_bone', [
		'Выпадает из зимогоров.'
	])
	///////////////// Прочный глубинный сланец /////////////////
	event.add('warden_and_sculk:reinforced_deepslate', [
		'Сломав этот блок, нарушится равновесие, и порталы откроются.',
		'Смотрите квест "Равновесие".'
	])
	///////////////// Камень фамильяра (для тренированной собаки) /////////////////
	event.add('kubejs:trained_doggy_revive_stone', [
		'Работает примерно как обычный камень фамильяра.',
		'Нажмите ПКМ на собачьей лежанке, чтобы воскресить питомца.',
		'Если лежанка никому не принадлежит, то воскреснет случайная собака.'
	])
	///////////////// Пилы /////////////////
	event.add('kubejs:flint_saw', [
		'Можно починить на наковальне с помощью кремния.'
	])
	event.add('kubejs:copper_saw', [
		'Можно починить на наковальне с помощью медного листа.'
	])
	event.add('kubejs:iron_saw', [
		'Можно починить на наковальне с помощью железного листа.'
	])
	///////////////// Око для портала /////////////////
	event.add('endrem:old_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:rogue_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:nether_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:cold_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:magical_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:black_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:lost_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:wither_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:guardian_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:cursed_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:exotic_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:evil_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:undead_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:cryptic_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:corrupted_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
	event.add('endrem:witch_eye', ['Это Око позволяет найти и открыть портал в Энд.\n', 'В каждой рамке должно быть уникальное Око.\n', 'Может сломаться при поиске портала.'])
})
